app/views/tweets/_tweet.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
            <% if @tweet.user.provider == "facebook" %>
              <% if @tweet.user.avatar.blank? %>