app/controllers/maps_controller.rb

SELECT `tweets`.* FROM `tweets`
---
  def index
    @tweets = Tweet.all