app/controllers/tweets_controller.rb

  def index
    @tweet = Tweet.new
    @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets`

  def create
    Tweet.create(is_crowd: create_params[:is_crowd], latitude: create_params[:latitude], longitude: create_params[:longitude], user_id: current_user.id, genre: create_params[:genre])
---
INSERT INTO `tweets` (`is_crowd`, `latitude`, `longitude`, `user_id`, `created_at`, `updated_at`) VALUES (1, 0.0, 0.0, 1, '2016-10-15 10:47:34', '2016-10-15 10:47:34')

  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 42 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 42