app/controllers/users_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 2
---
  def show
    @email = current_user.email
    @tweets = Tweet.where(user_id: current_user.id)